We first import all the needed libraries from python

In [7]:
#import cell
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
df = pd.read_csv('Data/uber-raw-data-apr14.csv', delimiter = ',')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  object
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  object
dtypes: float64(2), object(2)
memory usage: 17.2+ MB

In [ ]:
df.head() # Be sure to see if the file is completed and truncated properly.

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [10]:
df.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

In [11]:
df.columns

Index(['Date/Time', 'Lat', 'Lon', 'Base'], dtype='object')

In [13]:
df['Date/Time'] = pd.to_datetime(df['Date/Time'])
df.tail()

                 Date/Time      Lat      Lon    Base
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764

In [14]:
def get_dom(dt):
    return dt.day

In [16]:
df['day'] = df['Date/Time'].map(get_dom)

df.head()

            Date/Time      Lat      Lon    Base  day
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512    1
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512    1
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512    1
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512    1
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512    1

In [17]:
df.describe()

,Date/Time,Lat,Lon,day
count,564516,564516.000000,564516.000000,564516.000000
mean,2014-04-16 17:46:01.296261120,40.740005,-73.976817,16.117127
min,2014-04-01 00:00:00,40.072900,-74.773300,1.000000
25%,2014-04-08 16:27:00,40.722500,-73.997700,8.000000
50%,2014-04-16 19:19:00,40.742500,-73.984800,16.000000
75%,2014-04-24 22:14:00,40.760700,-73.970000,24.000000
max,2014-04-30 23:59:00,42.116600,-72.066600,30.000000
std,NaN,0.036083,0.050426,9.048139

In [18]:
def get_weekday(dt):
    return dt.weekday() #.weekday() is a method

In [19]:
df['weekday']= df['Date/Time'].map(get_weekday)

df.head()

            Date/Time      Lat      Lon    Base  day  weekday
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512    1        1
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512    1        1
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512    1        1
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512    1        1
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512    1        1

In [20]:
def get_hour(dt):
    return dt.hour #.hour is an attribute

In [22]:
df['hour'] = df['Date/Time'].map(get_hour)

df.head()

            Date/Time      Lat      Lon    Base  day  weekday  hour
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512    1        1     0
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512    1        1     0
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512    1        1     0
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512    1        1     0
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512    1        1     0

In [23]:
df.describe()

,Date/Time,Lat,Lon,day,weekday,hour
count,564516,564516.000000,564516.000000,564516.000000,564516.00000,564516.000000
mean,2014-04-16 17:46:01.296261120,40.740005,-73.976817,16.117127,2.86698,14.465043
min,2014-04-01 00:00:00,40.072900,-74.773300,1.000000,0.00000,0.000000
25%,2014-04-08 16:27:00,40.722500,-73.997700,8.000000,1.00000,10.000000
50%,2014-04-16 19:19:00,40.742500,-73.984800,16.000000,3.00000,16.000000
75%,2014-04-24 22:14:00,40.760700,-73.970000,24.000000,4.00000,19.000000
max,2014-04-30 23:59:00,42.116600,-72.066600,30.000000,6.00000,23.000000
std,NaN,0.036083,0.050426,9.048139,1.82081,5.873925